In [12]:
import numpy as np
import pandas as pd
from sqlalchemy import create_engine
from config import db_password
import boto3
import s3fs
import awscli
import timeit

In [13]:
tic=timeit.default_timer()
toc=timeit.default_timer()
toc - tic #elapsed time in seconds

3.370000013092067e-05

In [14]:
s3 = boto3.resource('s3')

for bucket in s3.buckets.all():
    print(bucket.name)

team3-final-bucket
wshih-bucket

In [15]:
my_bucket = s3.Bucket('team3-final-bucket')
for my_bucket_object in my_bucket.objects.all():
    print(my_bucket_object.key)

Resources_final/
Resources_raw/
Resources_raw/acquisitions.csv
Resources_raw/degrees.csv
Resources_raw/funding_rounds.csv
Resources_raw/funds.csv
Resources_raw/investments.csv
Resources_raw/ipos.csv
Resources_raw/milestones.csv
Resources_raw/objects.csv
Resources_raw/offices.csv
Resources_raw/people.csv
Resources_raw/relationships.csv

In [7]:
client = boto3.client('s3')
path = 's3://team3-final-bucket/Resources_raw/'

In [8]:
ipo_df= pd.read_csv(path + 'ipos.csv')
ipo_df.columns.tolist()

['id',
 'ipo_id',
 'object_id',
 'valuation_amount',
 'valuation_currency_code',
 'raised_amount',
 'raised_currency_code',
 'public_at',
 'stock_symbol',
 'source_url',
 'source_description',
 'created_at',
 'updated_at']

In [9]:
ipo_df.nunique()

id                         1259
ipo_id                     1259
object_id                  1253
valuation_amount            102
valuation_currency_code       5
raised_amount               114
raised_currency_code          5
public_at                   517
stock_symbol               1247
source_url                  191
source_description          177
created_at                 1258
updated_at                 1257
dtype: int64

In [10]:
ipo_df['valuation_currency_code'].unique()

array(['USD', 'JPY', nan, 'CAD', 'EUR', 'GBP'], dtype=object)

In [11]:
objects_df= pd.read_csv(path + 'objects.csv')
objects_df.columns.tolist()

C:\Users\phsstudent\anaconda3\envs\mlenv\lib\site-packages\IPython\core\interactiveshell.py:3072: DtypeWarning: Columns (3,7,9,10,17,18,21,22,23,25,26,29,30,37) have mixed types.Specify dtype option on import or set low_memory=False.
  interactivity=interactivity, compiler=compiler, result=result)

['id',
 'entity_type',
 'entity_id',
 'parent_id',
 'name',
 'normalized_name',
 'permalink',
 'category_code',
 'status',
 'founded_at',
 'closed_at',
 'domain',
 'homepage_url',
 'twitter_username',
 'logo_url',
 'logo_width',
 'logo_height',
 'short_description',
 'description',
 'overview',
 'tag_list',
 'country_code',
 'state_code',
 'city',
 'region',
 'first_investment_at',
 'last_investment_at',
 'investment_rounds',
 'invested_companies',
 'first_funding_at',
 'last_funding_at',
 'funding_rounds',
 'funding_total_usd',
 'first_milestone_at',
 'last_milestone_at',
 'milestones',
 'relationships',
 'created_by',
 'created_at',
 'updated_at']

In [17]:
with pd.option_context('display.max_rows', None, 'display.max_columns', None):  # more options can be specified also
    print(objects_df.dtypes)

id                      object
entity_type             object
entity_id                int64
parent_id               object
name                    object
normalized_name         object
permalink               object
category_code           object
status                  object
founded_at              object
closed_at               object
domain                  object
homepage_url            object
twitter_username        object
logo_url                object
logo_width               int64
logo_height              int64
short_description       object
description             object
overview                object
tag_list                object
country_code            object
state_code              object
city                    object
region                  object
first_investment_at     object
last_investment_at      object
investment_rounds        int64
invested_companies       int64
first_funding_at        object
last_funding_at         object
funding_rounds           int64
funding_total_usd      float64
first_milestone_at      object
last_milestone_at       object
milestones               int64
relationships            int64
created_by              object
created_at              object
updated_at              object
dtype: object

In [18]:
objects_df.head()

,id,entity_type,entity_id,parent_id,name,normalized_name,permalink,category_code,status,founded_at,...,last_funding_at,funding_rounds,funding_total_usd,first_milestone_at,last_milestone_at,milestones,relationships,created_by,created_at,updated_at
0,c:1,Company,1,NaN,Wetpaint,wetpaint,/company/wetpaint,web,operating,2005-10-17,...,2008-05-19,3,39750000.0,2010-09-05,2013-09-18,5,17,initial-importer,2007-05-25 06:51:27,2013-04-13 03:29:00
1,c:10,Company,10,NaN,Flektor,flektor,/company/flektor,games_video,acquired,NaN,...,NaN,0,0.0,NaN,NaN,0,6,initial-importer,2007-05-31 21:11:51,2008-05-23 23:23:14
2,c:100,Company,100,NaN,There,there,/company/there,games_video,acquired,NaN,...,NaN,0,0.0,2003-02-01,2011-09-23,4,12,initial-importer,2007-08-06 23:52:45,2013-11-04 02:09:48
3,c:10000,Company,10000,NaN,MYWEBBO,mywebbo,/company/mywebbo,network_hosting,operating,2008-07-26,...,NaN,0,0.0,NaN,NaN,0,0,NaN,2008-08-24 16:51:57,2008-09-06 14:19:18
4,c:10001,Company,10001,NaN,THE Movie Streamer,the movie streamer,/company/the-movie-streamer,games_video,operating,2008-07-26,...,NaN,0,0.0,NaN,NaN,0,0,NaN,2008-08-24 17:10:34,2008-09-06 14:19:18

In [26]:
objects_dropna = objects_df['last_funding_at'].dropna()
objects_dropna

0         2008-05-19
13        2008-02-26
18        2008-09-01
19        2013-08-13
20        2012-01-26
             ...
196537    2011-09-06
196540    2009-02-01
196547    2008-05-01
196549    2008-08-25
196552    2008-06-01
Name: last_funding_at, Length: 31507, dtype: object

In [36]:
objects_df['parent_id'].nunique()

11972

In [37]:
objects_df.nunique()

id                     462651
entity_type                 4
entity_id              264875
parent_id               11972
name                   445204
normalized_name        439326
permalink              462435
category_code              42
status                      9
founded_at               6323
closed_at                 999
domain                 155458
homepage_url           163622
twitter_username       119504
logo_url               208850
logo_width               3674
logo_height              3025
short_description        7614
description             85369
overview               234263
tag_list               101997
country_code              177
state_code                 51
city                    11077
region                   5977
first_investment_at      2682
last_investment_at       2378
investment_rounds         167
invested_companies        131
first_funding_at         3208
last_funding_at          2978
funding_rounds             16
funding_total_usd        9721
first_milestone_at       4225
last_milestone_at        4029
milestones                 10
relationships             172
created_by              80505
created_at             337606
updated_at             383541
dtype: int64

In [72]:
objects_df['relationships'].unique()

array([  17,    6,   12,    0,    2,    1,   14,    3,    9,   19,    4,
          8,    7,   45,    5,   28,   10,   91,   20,  100,   23,   15,
         11,   13,   27,   38,   50,   44,   59,   16,   29,   93,   21,
         24,   66,   60,   18,   22,   31,   37,   41,  127,   26,   42,
        103,   30,   49,   48,  101,   92,   25,   39,   36,  162,   51,
        168,   43,   34, 1189,   32,   35,   33,   70,   63,   55,   54,
         40,   73,   57,   47,   75,   95,  116,   52,   86,   77,   65,
         80,   56,   78,  151,  469,   46,   71,  104,  119,   64,  108,
        102,   76,  185,  296,  254,   88,  275,  197,   94,   83,  157,
         67,  324,   62,   68,   84,  105,  112,  109,   58,  163,  160,
         82,  625,  123,   96,  146,  547,  195,  314,  982,   85,   72,
         89,  246,  206,  870,  183,  155,   69,  122,   90,  387,  614,
         53,  144,   97,   87,  141,  666,  363,  118,  181,  143,  269,
        273,   61,  473, 1046,  392,  133,   79,  388,  153,  210,  117,
        126,  175,  140,  138,   74,  134,  130,  147,  139,  136,  226,
         81,  148,   99,  374,  311,  107,  169], dtype=int64)

In [46]:
rel_df= pd.read_csv(path + 'relationships.csv')
rel_df.columns.tolist()

['id',
 'relationship_id',
 'person_object_id',
 'relationship_object_id',
 'start_at',
 'end_at',
 'is_past',
 'sequence',
 'title',
 'created_at',
 'updated_at']

In [55]:
rel_df

,id,relationship_id,person_object_id,relationship_object_id,start_at,end_at,is_past,sequence,title,created_at,updated_at
0,1,1,p:2,c:1,NaN,NaN,0,8,Co-Founder/CEO/Board of Directors,2007-05-25 07:03:54,2013-06-03 09:58:46
1,2,2,p:3,c:1,NaN,NaN,1,279242,VP Marketing,2007-05-25 07:04:16,2010-05-21 16:31:34
2,3,3,p:4,c:3,NaN,NaN,0,4,Evangelist,2007-05-25 19:33:03,2013-06-29 13:36:58
3,4,4,p:5,c:3,2006-03-01,2009-12-01,1,4,Senior Director Strategic Alliances,2007-05-25 19:34:53,2013-06-29 10:25:34
4,6,6,p:7,c:4,2005-07-01,2010-04-05,1,1,Chief Executive Officer,2007-05-25 20:05:33,2010-04-05 18:41:41
...,...,...,...,...,...,...,...,...,...,...,...
402873,480903,480903,p:268527,c:286218,2005-01-01,2010-01-01,1,1,Sr. Consultant/Patent Agent,2013-12-12 14:35:35,2013-12-12 14:35:35
402874,480906,480906,p:268597,c:12612,NaN,NaN,0,1,"VP, GM & Editor In Chief - Clinical Decison Su...",2013-12-12 14:37:56,2013-12-12 14:37:56
402875,480907,480907,p:268528,c:286152,NaN,NaN,1,273049,Vice President,2013-12-12 14:39:36,2013-12-12 14:39:36
402876,480908,480908,p:268528,c:286220,NaN,NaN,1,1,"General Counsel, Director of Patents and Licen...",2013-12-12 14:39:48,2013-12-12 14:39:48
402877,480909,480909,p:268528,c:286221,NaN,NaN,1,1,Design Engineer,2013-12-12 14:40:04,2013-12-12 14:40:04

In [47]:
acquire_df= pd.read_csv(path + 'acquisitions.csv')
acquire_df.columns.tolist()

['id',
 'acquisition_id',
 'acquiring_object_id',
 'acquired_object_id',
 'term_code',
 'price_amount',
 'price_currency_code',
 'acquired_at',
 'source_url',
 'source_description',
 'created_at',
 'updated_at']

In [48]:
milestones= pd.read_csv(path + 'milestones.csv')
milestones.columns.tolist()

['id',
 'object_id',
 'milestone_at',
 'milestone_code',
 'description',
 'source_url',
 'source_description',
 'created_at',
 'updated_at']

In [49]:
offices= pd.read_csv(path + 'offices.csv')
offices.columns.tolist()

['id',
 'object_id',
 'office_id',
 'description',
 'region',
 'address1',
 'address2',
 'city',
 'zip_code',
 'state_code',
 'country_code',
 'latitude',
 'longitude',
 'created_at',
 'updated_at']

In [65]:
people= pd.read_csv(path + 'people.csv')
people.columns.tolist()

['id',
 'object_id',
 'first_name',
 'last_name',
 'birthplace',
 'affiliation_name']

In [66]:
people

            id object_id first_name last_name   birthplace affiliation_name
0            1       p:2        Ben   Elowitz          NaN        Blue Nile
1            2       p:3      Kevin  Flaherty          NaN         Wetpaint
2            3       p:4       Raju   Vegesna          NaN             Zoho
3            4       p:5        Ian     Wenig          NaN             Zoho
4            5       p:6      Kevin      Rose  Redding, CA     i/o Ventures
...        ...       ...        ...       ...          ...              ...
226704  226705  p:268589       John      Pins          NaN     Unaffiliated
226705  226706  p:268590      David  Schulhof          NaN     Unaffiliated
226706  226707  p:268592    Matthew  D. Rosen          NaN     Unaffiliated
226707  226708  p:268593     Gordon  Hutchins          NaN     Unaffiliated
226708  226709  p:268597     Denise     Basow          NaN     Unaffiliated

[226709 rows x 6 columns]

In [68]:
people = people.rename(columns = {'object_id':'person_id'})
people

            id person_id first_name last_name   birthplace affiliation_name
0            1       p:2        Ben   Elowitz          NaN        Blue Nile
1            2       p:3      Kevin  Flaherty          NaN         Wetpaint
2            3       p:4       Raju   Vegesna          NaN             Zoho
3            4       p:5        Ian     Wenig          NaN             Zoho
4            5       p:6      Kevin      Rose  Redding, CA     i/o Ventures
...        ...       ...        ...       ...          ...              ...
226704  226705  p:268589       John      Pins          NaN     Unaffiliated
226705  226706  p:268590      David  Schulhof          NaN     Unaffiliated
226706  226707  p:268592    Matthew  D. Rosen          NaN     Unaffiliated
226707  226708  p:268593     Gordon  Hutchins          NaN     Unaffiliated
226708  226709  p:268597     Denise     Basow          NaN     Unaffiliated

[226709 rows x 6 columns]

In [71]:
people = people.drop(columns={'birthplace'})
people

            id person_id first_name last_name affiliation_name
0            1       p:2        Ben   Elowitz        Blue Nile
1            2       p:3      Kevin  Flaherty         Wetpaint
2            3       p:4       Raju   Vegesna             Zoho
3            4       p:5        Ian     Wenig             Zoho
4            5       p:6      Kevin      Rose     i/o Ventures
...        ...       ...        ...       ...              ...
226704  226705  p:268589       John      Pins     Unaffiliated
226705  226706  p:268590      David  Schulhof     Unaffiliated
226706  226707  p:268592    Matthew  D. Rosen     Unaffiliated
226707  226708  p:268593     Gordon  Hutchins     Unaffiliated
226708  226709  p:268597     Denise     Basow     Unaffiliated

[226709 rows x 5 columns]

In [ ]:
s3.meta.client.upload_file('test.txt', 'demo-bucket-cdl2', 'test2.txt')

In [ ]:
db_string = f"postgres://postgres:{db_password}@127.0.0.1:5432/team3"